In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('../Panda/datasets_Placement_Data_Full_Class.csv')

# How to count  number of students having degree in Sci&Tech on dataset provided ?

In [13]:
###Method -1 

df_for_degree=df['degree_t'].value_counts()
df_for_degree['Sci&Tech']

59

In [22]:
###Method -2 

s = df['degree_t'] == 'Sci&Tech'
s.value_counts()
s.value_counts()[True]

0      Commerce
1       Science
2          Arts
3       Science
4      Commerce
         ...
210    Commerce
211     Science
212    Commerce
213    Commerce
214     Science
Name: hsc_s, Length: 215, dtype: object

#  How to select second row for columns hsc_s   from Dataset ?

In [23]:
df.loc[2,'hsc_s']

'Arts'

# How to print data at postion first row and third columns in dataset ?

In [30]:
#print(df.head(1))
df.iloc[0,3]

'Others'

#  How to print all column in 10th rows ?

In [31]:
df.iloc[10,:]

sl_no                    11
gender                    M
ssc_p                    58
ssc_b               Central
hsc_p                    61
hsc_b               Central
hsc_s              Commerce
degree_p                 60
degree_t          Comm&Mgmt
workex                  Yes
etest_p                  62
specialisation       Mkt&HR
mba_p                 60.85
status               Placed
salary               260000
Name: 10, dtype: object

#  What is difference between loc and iloc ?

In [33]:
# loc -by label 
# iloc - by position  - this means each rows and column in padas has index provived by panda so we can use it

In [34]:
df.head(10)

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.00,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.50,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.00,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.00,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.80,Mkt&Fin,55.50,Placed,425000.0
5,6,M,55.00,Others,49.80,Others,Science,67.25,Sci&Tech,Yes,55.00,Mkt&Fin,51.58,Not Placed,NaN
6,7,F,46.00,Others,49.20,Others,Commerce,79.00,Comm&Mgmt,No,74.28,Mkt&Fin,53.29,Not Placed,NaN
7,8,M,82.00,Central,64.00,Central,Science,66.00,Sci&Tech,Yes,67.00,Mkt&Fin,62.14,Placed,252000.0
8,9,M,73.00,Central,79.00,Central,Commerce,72.00,Comm&Mgmt,No,91.34,Mkt&Fin,61.29,Placed,231000.0
9,10,M,58.00,Central,70.00,Central,Commerce,61.00,Comm&Mgmt,No,54.00,Mkt&Fin,52.21,Not Placed,NaN

# How to take avarage of mba_p and degree_p in dataset provided ?

av = (df['mba_p'] + df['degree_p'])/2
df= df.assign(average=av)
print(df[['mba_p','degree_p','average']])

# How to sort student based on percentage in depgree_p ?

In [53]:
print(df.sort_values('degree_p').head(3))
print(df.sort_values('degree_p').tail(3))

    sl_no gender  ssc_p    ssc_b  hsc_p    hsc_b     hsc_s  degree_p  \
14     15      M  62.00  Central   47.0  Central  Commerce      50.0
25     26      F  52.58   Others   54.6  Central  Commerce      50.2
91     92      M  52.00  Central   57.0  Central  Commerce      50.8

     degree_t workex  etest_p specialisation  mba_p      status  salary  \
14  Comm&Mgmt     No     76.0         Mkt&HR  54.96  Not Placed     NaN
25  Comm&Mgmt    Yes     76.0        Mkt&Fin  65.33  Not Placed     NaN
91  Comm&Mgmt     No     67.0         Mkt&HR  62.79  Not Placed     NaN

    average
14   52.480
25   57.765
91   56.795
     sl_no gender  ssc_p   ssc_b  hsc_p    hsc_b     hsc_s  degree_p  \
152    153      F  75.40  Others   60.5  Central   Science      84.0
21      22      F  79.00  Others   76.0   Others  Commerce      85.0
197    198      F  83.96  Others   53.0   Others   Science      91.0

      degree_t workex  etest_p specialisation  mba_p  status    salary  \
152   Sci&Tech     No    98.00        Mkt&Fin  65.25  Placed  240000.0
21   Comm&Mgmt     No    95.00        Mkt&Fin  69.06  Placed  393000.0
197   Sci&Tech     No    59.32         Mkt&HR  69.71  Placed  260000.0

     average
152   74.625
21    77.030
197   80.355

# What is Max average score by student?

In [55]:
df['average'].max()

80.35499999999999

# How to details  of student with Max average?

In [61]:
df.loc[df['average'].idxmax(),:]

sl_no                  198
gender                   F
ssc_p                83.96
ssc_b               Others
hsc_p                   53
hsc_b               Others
hsc_s              Science
degree_p                91
degree_t          Sci&Tech
workex                  No
etest_p              59.32
specialisation      Mkt&HR
mba_p                69.71
status              Placed
salary              260000
average             80.355
Name: 197, dtype: object